a, b = 10, 3  # объявили две переменные

print(a, '+', b, '=', a + b)  # оператор сложения
print(a, '-', b, '=', a - b)  # оператор вычитания
print(a, '*', b, '=', a * b)  # оператор умножения
print(a, '/', b, '=', a / b)  # оператор деления
print(a, '//', b, '=', a // b)  # оператор деления нацело
print('Остаток от деления', a, 'на', b, '=', a % b)  # оператор остатка от деления
print(a, 'в степени', b, '=', a ** b)  # оператор возведения в степень

a += 1  # инкремент (a = a + 1)
b -= 1  # декремент (b = b - 1)
